## 고객과 잘 맞는 타입 추천 :)
### basic1 데이터와 basic3 데이터를 'f4'값을 기준으로 병합하고, 
### 병합한 데이터에서 r2결측치를 제거한다음, 앞에서 부터 20개 데이터를 선택하고 'f2'컬럼 합을 구하시오

- basic1.csv: 고객 데이터 
- basic3.csv: 잘 어울리는 관계 데이터 (추천1:r1, 추천2:r2)

In [2]:
# 라이브러리 및 데이터 로드
import pandas as pd
b1 = pd.read_csv("data/basic1.csv")
b3 = pd.read_csv("data/basic3.csv")

In [3]:
b1.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [4]:
b3.head()

     f4    r1    r2
0  INFP  ENFJ  ENTJ
1  ENFP  INFJ   NaN
2  INFJ  ENFP  ENTP
3  ENFJ  INFP  ISFP
4  INTJ  ENFP  ENTP

In [7]:
# 자료 병합. (b1을 기준으로 왼쪽 조인)

df = pd.merge(b1, b3, how = 'left', on = 'f4')
print(df.head())
df.shape

     id   age city    f1  f2   f3    f4         f5    r1    r2
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  INFP  ISFP
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  INFP  ISFP
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986  ESFP   NaN
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078  ENFJ  ENTJ
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869  ESFP  ESTP

(100, 10)

In [13]:
# r2 결측치 제거 

df.dropna(subset = ['r2'], axis = 0, inplace = True)

In [16]:
print(df.isna().sum())
print(df.shape)

id       0
age      0
city     0
f1      27
f2       0
f3      78
f4       0
f5       0
r1       0
r2       0
dtype: int64
(83, 10)

In [18]:
# 그냥 혹시모르니 인덱스 리셋
df.reset_index(inplace = True)

In [21]:
print(df.head(20).f2.sum())

15